app/controllers/posts_controller.rb

INSERT INTO "posts" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@post = Post.new(permit_post)
  	if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 28]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 28]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.delete